ut.ДоработкиАурум/src/Documents/ПриобретениеТоваровУслуг/ПриобретениеТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="5e0d9dd9-464c-4fa3-984a-2a2da8517f38">
  <name>ПриобретениеТоваровУслуг</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:Document>

ut.ДоработкиАурум/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="351b0c5b-74c3-4aaa-a93b-7246b941f797">
  <name>ХозяйственныеОперации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="c8cae29b-ba90-4b79-9584-2f9e9971dd25">
    <name>ЗакупкаУПоставщикаФактуровкаПоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="76156fda-6b2e-4da7-871d-49dfc4840df3">
    <name>ПриемНаКомиссию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="955ac7a2-906a-4d2b-9be1-a41ee11cec54">
    <name>ЗакупкаПоИмпорту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="26caefe6-3e76-4d73-9387-208213b91b67">
    <name>ЗакупкаВСтранахЕАЭС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="6982524e-4873-4f26-b5f2-355851663d52">
    <name>ЗакупкаУПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="be85d9cc-2632-45bb-a18a-01558fe3b7eb">
    <name>ЗакупкаПоИмпортуТоварыВПути</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="7512207c-c53f-4c94-9c6d-70057ef0ebe0">
    <name>ЗакупкаУПоставщикаТоварыВПути</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c89cfc05-3d8b-4809-9775-d96b96c1befb">
    <name>ЗакупкаВСтранахЕАЭСТоварыВПути</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c5718917-70eb-45ed-8147-7ede09e4567e">
    <name>ЗакупкаВСтранахЕАЭСФактуровкаПоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e46ad85d-8b38-4c69-800a-a5585af527ea">
    <name>ПриемНаХранениеСПравомПродажи</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="0eec1c7a-4e84-488a-a0de-5ddf74b27a9c">
    <name>ЗакупкаЧерезПодотчетноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a52a5aca-aa86-429b-b461-dbd79e1dbe24">
    <name>ЗакупкаУПоставщикаРеглУчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1e18177a-fe02-4999-a369-fb008fe9fd42">
    <name>ПеречислениеВБюджет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="692215c8-f484-4e22-b24f-430cd2009fae">
    <name>ОплатаДенежныхСредствВДругуюОрганизацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="95818758-8542-4405-8773-6b644d757e22">
    <name>ВыдачаДенежныхСредствПодотчетнику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1879ad4f-47e1-438b-9738-f1429bc3c780">
    <name>ПеречислениеТаможне</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="da785c97-98fb-4ee6-8990-f175fe8496ef">
    <name>КонвертацияВалюты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b5771beb-5568-450d-963a-bfe9090b7f8c">
    <name>ВыдачаЗаймов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1923f574-7981-46df-b96d-b293c2f88d8c">
    <name>ОплатаПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a07305c5-0d5c-4195-8220-2eb29fa05ef5">
    <name>ВнутренняяПередачаДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d0e70b4c-e687-4b56-a586-c641aa8d81ae">
    <name>ВыплатаЗарплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2d869152-e27f-4d56-a690-de6ac662ace2">
    <name>ОплатаПоКредитам</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="572c15b7-b781-43a9-91fb-eecc7ecffee8">
    <name>ПеречислениеНаДепозиты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="6915db6f-cc8d-4766-aca9-84cf48edcd58">
    <name>ВыдачаЗаймаСотруднику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="693adf02-fccb-4cd9-a092-f9fa532b7983">
    <name>ПрочаяВыдачаДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="724dc975-c8d5-4eea-b4af-52c1b39555e5">
    <name>ВозвратОплатыКлиенту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="51ad2381-0d1f-4a17-823e-32dfa2be2232">
    <name>ВозвратДенежныхСредствВДругуюОрганизацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b4199927-65e9-4e54-90f9-456e4c68a93f">
    <name>ВыплатаЗарплатыПоЗарплатномуПроекту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="6d079ef6-b405-487d-9ff8-d6cbe795713f">
    <name>ВыплатаЗарплатыНаЛицевыеСчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="240b34c3-b18a-47c5-9f2f-bd241e23e42a">
    <name>ВыплатаЗарплатыЧерезКассу</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="4dec627e-3939-4191-a213-0cea734fc86c">
    <name>РеализацияКлиенту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a606d3e5-4a59-4b2c-9d3d-5976f5c778cf">
    <name>ПередачаНаКомиссию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="3299776f-a304-476e-a0d9-a9132b128869">
    <name>РеализацияКлиентуРеглУчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="0789d7c2-8020-4d52-a305-445f9faa9b76">
    <name>РеализацияБезПереходаПраваСобственности</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="31929dfa-7279-421f-b4b9-582f5be1cdf7">
    <name>ВозвратНеперечисленнойЗарплатыПоЗарплатномуПроекту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="9ff12120-7050-4660-86f3-140446414c52">
    <name>ПоступлениеОплатыПоПлатежнойКарте</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="4ac85485-9869-40c0-8401-4c0baf1156e8">
    <name>ПрочееПоступлениеДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="6e69e44b-cbbe-4982-8f26-1be872c32c8c">
    <name>ПоступлениеДенежныхСредствИзДругойОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="10db127e-a377-4878-8ead-955d0ff48e4d">
    <name>ПоступлениеОплатыОтКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1c023e8f-1b5a-4b35-97d4-60fe80d01b9d">
    <name>ПоступлениеДенежныхСредствСДругогоСчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a3a02f06-9e98-46a0-9f43-3b22273b464b">
    <name>ПоступлениеДенежныхСредствИзКассыНаРасчетныйСчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b9fe55ec-e34e-456a-a063-8a1820ff6b8d">
    <name>ПоступлениеДенежныхСредствПоКредитам</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="eeb1bb2f-e486-4bd8-ad41-e45f34286664">
    <name>ПоступлениеДенежныхСредствПоДепозитам</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="4cea7021-99a1-4ae8-b197-4a33688ff882">
    <name>ПоступлениеДенежныхСредствПоЗаймамВыданным</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="29c2681f-21ab-4e2a-a0bf-2b3bee568c76">
    <name>ПогашениеЗаймаСотрудником</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="6bce5d35-b51a-4b89-8539-2ac2eb87fa3d">
    <name>ВозвратДенежныхСредствОтПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d23d95eb-aa25-4f32-9010-be00be4d7215">
    <name>ВозвратДенежныхСредствОтПодотчетника</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="8adc8fdb-3180-4f55-b140-3b1c2a8a3a42">
    <name>ВозвратДенежныхСредствОтДругойОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="656e6b4e-13d8-48be-8733-4b07cd1c1011">
    <name>ВозвратНеперечисленныхДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="dadac293-8e2e-4daa-ba9a-ab167dca3f46">
    <name>ИнкассацияДенежныхСредствИзБанка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1cf8111d-9689-46b5-b048-01942b9c91aa">
    <name>ПоступлениеДенежныхСредствИзДругойКассы</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f9500d19-47d4-45e9-b867-8546e73cc587">
    <name>ПоступлениеДенежныхСредствИзКассыККМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="39b63e72-b74f-41a5-8d5c-68908eab2196">
    <name>ПоступлениеДенежныхСредствИзБанка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f891b289-9e02-497b-bd51-ba552515b92e">
    <name>ПеречислениеДенежныхСредствНаДругойСчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b0cd3753-59f3-4880-83e3-aeb9c7301a80">
    <name>СнятиеНаличныхДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="8ed431c8-e520-4853-99da-e30f78c67d3c">
    <name>СдачаДенежныхСредствВБанк</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="883d636d-f604-43b6-9d3c-4aa11be20085">
    <name>ВыплатаЗарплатыРаботнику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="987c15be-84c5-4923-a839-5533e7ab4c5c">
    <name>ВыплатаЗарплатыРаздатчиком</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="5378e85b-b5ef-4819-816d-7cff3ed3291f">
    <name>ИнкассацияДенежныхСредствВБанк</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="ce981ba1-51f7-44d0-99db-29d24af3a802">
    <name>ВыдачаДенежныхСредствВДругуюКассу</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c7a92b86-d4b7-444e-b574-99f2caed6111">
    <name>ВыдачаДенежныхСредствВКассуККМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="865f1a25-35d6-4509-98be-1c0be0897324">
    <name>ВозвратДенежныхСредствОтАрендодателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="aee89418-2c06-47ad-bf28-064f762e59aa">
    <name>ВозвратОплатыНаПлатежнуюКарту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="15ce947b-5b8c-4087-b372-2f3f60dedd76">
    <name>ОплатаАрендодателю</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="8880d304-daf7-4345-ad8d-c81bc5d994b7">
    <name>РеализацияЧерезКомиссионера</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f24e8e16-21ad-4eeb-a73d-06152c4d9a1e">
    <name>РеализацияЧерезКомиссионераБезПереходаПраваСобственности</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f675a52b-940a-480e-8374-c64ff49e4478">
    <name>СборкаТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="ad2322ce-9ed5-4e79-ace7-6f03b97d9445">
    <name>РазборкаТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1dfdfca3-6595-4afd-a12f-88601fce8c82">
    <name>ПеремещениеТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f225cb28-e5ab-48fc-80a6-180753692cee">
    <name>ПеремещениеТоваровМеждуФилиалами</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="82e6dbf8-d7ba-4382-9880-9e83d175a158">
    <name>СписаниеТоваровПоТребованию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b6be92ab-cbab-4fd0-aa01-b1aeaa303045">
    <name>УдалитьОплатаСамозанятому</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1818e828-c90c-4c57-aac0-0dbde13a4579">
    <name>ВозвратНалогов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ut.ДоработкиАурум/src/Documents/ПриобретениеТоваровУслуг/ObjectModule.bsl
&После("ПередЗаписью")
Процедура АУ_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если НачалоДня(ТекущаяДата())<>НачалоДня(Дата) Тогда
		Дата=НачалоДня(Дата)+25200;
	КонецЕсли;
	
	Для каждого стрТовары Из ЭтотОбъект.Товары Цикл
		
		Если стрТовары.СтатусУказанияСерий <> 0 
			И стрТовары.СтатусУказанияСерий <> 1
			И стрТовары.СтатусУказанияСерий <> 2
			И стрТовары.СтатусУказанияСерий <> 21
			И НЕ ЗначениеЗаполнено(стрТовары.Серия) Тогда
			
			стрТовары.Серия = АУ_ОбщиеПроцедурыИФункцииСерверПовтИсп.ПолучитьЗначениеНастройки("СерияБезСерии");
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&ИзменениеИКонтроль("ЗаполнитьАналитикиУчетаНоменклатурыВТабличныхЧастяхТоваров")
Процедура АУ_ЗаполнитьАналитикиУчетаНоменклатурыВТабличныхЧастяхТоваров(ТаблицыДокумента = Неопределено)

	Если ТаблицыДокумента = Неопределено Тогда
		ТаблицыДокумента = Документы.ПриобретениеТоваровУслуг.КоллекцияТабличныхЧастейТоваров();
		
		ЗаполнитьЗначенияСвойств(ТаблицыДокумента, ЭтотОбъект);
	КонецЕсли;
	
	ТаблицаТовары = ТаблицыДокумента.Товары;
	
	МестаУчета = РегистрыСведений.АналитикаУчетаНоменклатуры.МестаУчета(ХозяйственнаяОперация,
																		Склад,
																		Подразделение,
																		Партнер,
																		Договор);
	
	ОперацииВПутиИФактуровка = Новый Массив;
	ОперацииВПутиИФактуровка.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСТоварыВПути);
	ОперацииВПутиИФактуровка.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпортуТоварыВПути);
	ОперацииВПутиИФактуровка.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщикаТоварыВПути);
	ОперацииВПутиИФактуровка.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСФактуровкаПоставки);
	ОперацииВПутиИФактуровка.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщикаФактуровкаПоставки);
	
	// Если Склад - группа, то для аналитики учета номенклатуры склад берем из ТЧ
	ИменаПолей = РегистрыСведений.АналитикаУчетаНоменклатуры.ИменаПолейКоллекцииПоУмолчанию();
	
	ОперацииФактуровка = Новый Массив;
	ОперацииФактуровка.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСФактуровкаПоставки);
	ОперацииФактуровка.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщикаФактуровкаПоставки);
	
 	Если ОперацииФактуровка.Найти(ХозяйственнаяОперация) <> Неопределено
		И (Не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВариантОформленияДокументовПоступленияПоУслугам") = 
			Перечисления.ВариантыОформленияДокументовПоУслугам.ПоступлениеУслугНеИспользуется) Тогда
		
		МестаУчета.Работа = Договор;
		МестаУчета.Вставить("Услуга", Договор);
		
	Иначе
		
		ИменаПолей.Вставить("Работа", "Подразделение");
		
	КонецЕсли;
	
	ТекстПоляСкладТовар = "
		|ВЫБОР
		|	КОГДА Коллекция.СписатьНаРасходы
		|		ТОГДА Коллекция.Подразделение
		|	ИНАЧЕ НЕОПРЕДЕЛЕНО
		|КОНЕЦ";
	
	Если ЗначениеЗаполнено(Склад) Тогда
		РеквизитыСклада = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Склад, "ЭтоГруппа, ВыборГруппы");
	Иначе
		РеквизитыСклада = Новый Структура;
		РеквизитыСклада.Вставить("ЭтоГруппа",	Ложь);
		РеквизитыСклада.Вставить("ВыборГруппы",	Неопределено);
	КонецЕсли;
	
	Если РеквизитыСклада.ЭтоГруппа
		И ОперацииВПутиИФактуровка.Найти(ХозяйственнаяОперация) = Неопределено
		И РеквизитыСклада.ВыборГруппы = Перечисления.ВыборГруппыСкладов.РазрешитьВЗаказахИНакладных Тогда
		
		ИменаПолей.Вставить("Произвольный", "Склад");
		
		ТекстПоляСкладТовар = "
			|ВЫБОР
			|	КОГДА Коллекция.СписатьНаРасходы
			|		ТОГДА Коллекция.Подразделение
			|	ИНАЧЕ Коллекция.Склад
			|КОНЕЦ";
		
	КонецЕсли;
	
	ИменаПолей.Вставить("Товар", Новый Структура("ТекстПоля", ТекстПоляСкладТовар));
	
	#Удаление
	РегистрыСведений.АналитикаУчетаНоменклатуры.ЗаполнитьВКоллекции(ТаблицаТовары, МестаУчета, ИменаПолей);
	#КонецУдаления
	#Вставка
	Если СокрЛП(ТаблицаТовары) = "ДокументТабличнаяЧасть.ПриобретениеТоваровУслуг.Товары" Тогда
		Для каждого стрТовары Из ТаблицаТовары Цикл
			
			Если ЗначениеЗаполнено(стрТовары.Склад) Тогда
				МестаУчета.Произвольный = стрТовары.Склад;
			Иначе
				МестаУчета.Произвольный = ЭтотОбъект.Склад;
			КонецЕсли;
			
			ТЗ = ТаблицаТовары.Выгрузить(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(стрТовары));
			ТЗ[0].НомерСтроки = 1;
			РегистрыСведений.АналитикаУчетаНоменклатуры.ЗаполнитьВКоллекции(ТЗ, МестаУчета, ИменаПолей);
			
			стрТовары.АналитикаУчетаНоменклатуры = ТЗ[0].АналитикаУчетаНоменклатуры;
			
		КонецЦикла;
	КонецЕсли;
	#КонецВставки
	
КонецПроцедуры

&После("ОбработкаЗаполнения")
Процедура АУ_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("Структура") Тогда
		
		Если ДанныеЗаполнения.Свойство("ДокументОснование")	И ТипЗнч(ДанныеЗаполнения.ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			Комментарий=ДанныеЗаполнения.ДокументОснование.Комментарий;
		ИначеЕсли ДанныеЗаполнения.Свойство("ДокументОснование") И ТипЗнч(ДанныеЗаполнения.ДокументОснование) = Тип("Массив") Тогда
			Для каждого стр Из ДанныеЗаполнения.ДокументОснование Цикл
				Комментарий=стр.Комментарий;
				Прервать;
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		Комментарий=ДанныеЗаполнения.Комментарий;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Организация) Тогда
		ЭтотОбъект.Организация = АУ_ОбщиеПроцедурыИФункцииСерверПовтИсп.ПолучитьЗначениеНастройки("ОрганизацияАурум");
	КонецЕсли;
	
КонецПроцедуры

&После("ЗаполнитьДокументНаОснованииЗаказаПоставщику")
Процедура АУ_ЗаполнитьДокументНаОснованииЗаказаПоставщику(Знач ДокументОснование, Знач СкладПоступления, РеквизитыЗаказа)
	
	Если ТипЗнч(ДокументОснование)=Тип("Массив") Тогда
		
		Для каждого стрЗаказ Из ДокументОснование Цикл
			
			Для каждого стрТовары Из ЭтотОбъект.Товары Цикл
				НайденныеСтроки=стрЗаказ.Товары.НайтиСтроки(Новый Структура("КодСтроки,Номенклатура,Характеристика",стрТовары.КодСтроки,стрТовары.Номенклатура,стрТовары.Характеристика));
				Если НайденныеСтроки.Количество()>0 Тогда
					стрТовары.АУ_Шифр=НайденныеСтроки[0].АУ_Шифр;
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;
		
	Иначе
		
		Для каждого стрТовары Из ДокументОснование Цикл
			НайденныеСтроки=стрЗаказ.Товары.НайтиСтроки(Новый Структура("КодСтроки,Номенклатура,Характеристика",стрТовары.КодСтроки,стрТовары.Номенклатура,стрТовары.Характеристика));
			Если НайденныеСтроки.Количество()>0 Тогда
				стрТовары.АУ_Шифр=НайденныеСтроки[0].АУ_Шифр;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&После("ОбработкаПроверкиЗаполнения")
Процедура АУ_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	
	
КонецПроцедуры
